app/controllers/blogs_controller.rb

SELECT  "blogs".* FROM "blogs"   ORDER BY "blogs"."id" DESC LIMIT 2
SELECT "blogs".* FROM "blogs"
---
	def index
    per_page = 5
    @page = params[:page].to_i
    @page = 1 if @page == 0
    num_blogs = Blog.count
    @num_pages = (num_blogs / per_page)
    @num_pages += 1 if @num_pages != 0
		if num_blogs > per_page then
      @blogs = Blog.offset((@page-1) * per_page).last(per_page).reverse
    else
      @blogs = Blog.all.reverse

SELECT  "blogs".* FROM "blogs"  WHERE "blogs"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "blogs".* FROM "blogs"   ORDER BY "blogs"."id" DESC LIMIT 3
---
	def show
		@blog = Blog.find(params[:id])
		@blogs = Blog.last(3).reverse

INSERT INTO "blogs" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-05-20 21:58:18.184810"], ["updated_at", "2014-05-20 21:58:18.184810"]]
---
	def create
		@blog = Blog.new
		@blog.title = params[:blog][:title]
    author = params[:blog][:author]
    if author.blank?
      @blog.author = 'Clovis Wrestling'
    else
      @blog.coach = Coach.find(params[:blog][:author])
      @blog.author = @blog.coach.name
    end
		@blog.article = params[:blog][:article]

    if params[:blog][:image]
      image_filename = params[:blog][:image].original_filename
      path = Rails.root.join('app', 'assets', 'images', image_filename)
      File.open(path, 'wb') do |f|
        f.write(params[:blog][:image].read)
      end
    else
      image_filename = 'clovisC.png'
    end


		@blog.image_id = image_filename

		if @blog.save