app/controllers/coaches_controller.rb

SELECT "coaches".* FROM "coaches"
---
	def index
		@coaches = Coach.all

SELECT  "coaches".* FROM "coaches"  WHERE "coaches"."user_id" = 'stirapelle' LIMIT 1
SELECT "coaches".* FROM "coaches"
SELECT COUNT(*) FROM "coaches"
---
	def show
		@coach = Coach.find_by_user_id(params[:id])
    temp_coaches = Coach.all
    @coaches = []
    num_coaches = Coach.count