app/controllers/home_controller.rb

SELECT  "blogs".* FROM "blogs"   ORDER BY "blogs"."id" DESC LIMIT 1
---
  def index
  	@post = Blog.last