app/controllers/wrestlers_controller.rb

	def index
		@wrestlers = Wrestler.all
---
SELECT "wrestlers".* FROM "wrestlers"